In [1]:
import numpy as np
import pandas as pd

In [33]:
df_student_test_math_data = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                                         'ID':[10,56,31,85,9,22]
                                         })

In [34]:
df_student_test_science_data = pd.DataFrame({'student':['Tom','Ram','David'],
                                            'ID':[10,85,22]
                                            })

In [35]:
pd.merge(df_student_test_math_data,df_student_test_science_data)

   ID student
0  10     Tom
1  85     Ram
2  22   David

In [36]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='student')

   ID_x student  ID_y
0    10     Tom    10
1    85     Ram    85
2    22   David    22

In [40]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='right')

   ID student_x student_y
0  10       Tom       Tom
1  85       Ram       Ram
2  22     David     David

In [45]:
(pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='left')).fillna('X')

   ID student_x student_y
0  10       Tom       Tom
1  56      Jack         X
2  31       Dan         X
3  85       Ram       Ram
4   9      Jeff         X
5  22     David     David

In [42]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='outer')

   ID student_x student_y
0  10       Tom       Tom
1  56      Jack       NaN
2  31       Dan       NaN
3  85       Ram       Ram
4   9      Jeff       NaN
5  22     David     David

In [51]:
pd.concat([df_student_test_math_data,df_student_test_science_data],ignore_index=True)

   ID student
0  10     Tom
1  56    Jack
2  31     Dan
3  85     Ram
4   9    Jeff
5  22   David
6  10     Tom
7  85     Ram
8  22   David

In [63]:
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                         'ID':[10,56,10,85,9,56]
                                         })

In [64]:
df_student_survey_data

   ID student
0  10     Tom
1  56    Jack
2  10     Tom
3  85     Ram
4   9    Jeff
5  56    Jack

In [65]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [66]:
df_student_survey_data.drop_duplicates()

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

In [73]:
df_student_survey_data.drop_duplicates(['student'])

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

In [74]:
df_student_survey_data.drop_duplicates('ID')

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff